Table of Contents
 Class CrossSectionGeneralColdFormed
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
Creates one item cross-section of general cold formed profile defined by it´s center line
[OpenModelClass("CI.StructModel.Libraries.CrossSection.CrossSection,CI.CrossSection", "CI.StructModel.Libraries.CrossSection.ICrossSection,CI.BasicTypes", typeof(CrossSection))]
public class CrossSectionGeneralColdFormed : CrossSection
Inheritance
object
OpenObject
OpenElementId
CrossSection
CrossSectionGeneralColdFormed
Inherited Members
 CrossSection.Name
 CrossSection.CrossSectionRotation
 CrossSection.IsInPrincipal
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 CrossSectionGeneralColdFormed()
Constructor
public CrossSectionGeneralColdFormed()
Properties
 Centerline
Centerline of cross-section made from linear segments
public PolyLine2D Centerline { get; set; }
Property Value
PolyLine2D
 CrossSectionType
Type of cross-section
public CrossSectionType CrossSectionType { get; set; }
Property Value
CrossSectionType
 Material
Material of cross-section
public ReferenceElement Material { get; set; }
Property Value
ReferenceElement
 Radius
Inner rounding radius between linear segments of centerline
public double Radius { get; set; }
Property Value
double
 Thickness
Thickness of thin wall cross-section
public double Thickness { get; set; }
Property Value
double
 Edit this page